TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/stm32wba/sid_900/STM32_WPAN/App/app_sidewalk.c
static const osThreadAttr_t demo_counter_task_attributes = {
    .name         = "Demo Counter Task",
    .priority     = DEMO_COUNTER_TASK_PRIO,
    .stack_size   = DEMO_COUNTER_TASK_STACK_SIZE,
    .attr_bits    = TASK_DEFAULT_ATTR_BITS,
    .cb_mem       = TASK_DEFAULT_CB_MEM,
    .cb_size      = TASK_DEFAULT_CB_SIZE,
    .stack_mem    = TASK_DEFAULT_STACK_MEM,
};

#if SID_PAL_LOG_ENABLED
static const char * const sid_subghz_profile_strings[] = {
    [SID_LORA_PROFILE_A]         = "LoRa Profile A",
    [SID_LORA_PROFILE_B]         = "LoRa Profile B",
    [SID_FSK_PROFILE_1]          = "FSK Profile 1",
    [SID_FSK_PROFILE_2]          = "FSK Profile 2",
    [SID_SUBGHZ_PROFILE_UNKNOWN] = "Unknown",
};

static const char * const sid_subghz_wakeup_type_strings[] = {
    [SID_NO_WAKEUP]        = "No Wakeup",
    [SID_TX_ONLY_WAKEUP]   = "Tx Only",
    [SID_RX_ONLY_WAKEUP]   = "Rx Only",
    [SID_TX_AND_RX_WAKEUP] = "Tx & Rx",
};
#endif /* SID_PAL_LOG_ENABLED */

/* Private function prototypes -----------------------------------------------*/

static void         queue_event(osMessageQueueId_t queue, enum event_type event);
static void         on_sidewalk_event(bool in_isr, void *context);
static void         on_sidewalk_msg_received(const struct sid_msg_desc *msg_desc, const struct sid_msg *msg, void *context);
static void         on_sidewalk_msg_sent(const struct sid_msg_desc *msg_desc, void *context);
static void         on_sidewalk_send_error(sid_error_t error, const struct sid_msg_desc *msg_desc, void *context);
static void         on_sidewalk_status_changed(const struct sid_status *status, void *context);
static void         on_sidewalk_factory_reset(void *context);
static void         send_ping(app_context_t *app_context);
static void         factory_reset(app_context_t * const context);
static void         print_subghz_link_profile(const app_context_t * const context);
#if SID_SDK_CONFIG_ENABLE_LINK_TYPE_2
static void         adjust_sidewalk_link_log_level(const uint32_t link_mask);
#endif /* SID_SDK_CONFIG_ENABLE_LINK_TYPE_2 */
static sid_error_t  init_and_start_link(app_context_t * const context, struct sid_config * const config, const bool cold_start);

static void         sidewalk_stack_task_entry(void *context);
static void         demo_counter_task_entry(void *context);
#if SID_PAL_LOG_ENABLED
static const char * sid_subghz_profile_code_to_str(enum sid_device_profile_id code);
#endif /* SID_PAL_LOG_ENABLED */
#if (CFG_BUTTON_SUPPORTED == 1)
#  if (defined(STM32WBA6x) && !defined(SID_RADIO_PLATFORM_LR11XX) && !defined(SID_RADIO_PLATFORM_SX126X)) || !defined(STM32WBA6x) /* Semtech shields share the same EXTI line for BUSY signal */
static void         button1_irq_handler(uint32_t pin, void * callback_arg);
#  endif /* (STM32WBA6x && !SID_RADIO_PLATFORM_LR11XX && !SID_RADIO_PLATFORM_SX126X) || !STM32WBA6x */
#  if (defined(STM32WBA5x) && !defined(SID_RADIO_PLATFORM_LR11XX) && !defined(SID_RADIO_PLATFORM_SX126X)) || !defined(STM32WBA5x) /* Semtech shields use the same GPIO pin for BUSY signal */
static void         button2_irq_handler(uint32_t pin, void * callback_arg);
#  endif /* (STM32WBA5x && !SID_RADIO_PLATFORM_LR11XX && !SID_RADIO_PLATFORM_SX126X) || !STM32WBA5x */
static void         button3_irq_handler(uint32_t pin, void * callback_arg);
#  if (CFG_LPM_STDBY_SUPPORTED != 0)
static void         button3_wakeup_handler(uint32_t pin, void * callback_arg);
#  endif /* (CFG_LPM_STDBY_SUPPORTED != 0) */
static void         buttons_init(void);
#endif /* (CFG_BUTTON_SUPPORTED == 1) */

/* Private function definitions ----------------------------------------------*/

static void queue_event(osMessageQueueId_t queue, enum event_type event)
{
    osMessageQueuePut(queue, &event, 0u, 0u);
}

/*----------------------------------------------------------------------------*/

static void on_sidewalk_event(bool in_isr, void *context)
{
    (void)in_isr;

    app_context_t *app_context = (app_context_t *)context;
    queue_event(app_context->event_queue, EVENT_TYPE_SIDEWALK);
}

/*----------------------------------------------------------------------------*/

static void on_sidewalk_msg_received(const struct sid_msg_desc *msg_desc, const struct sid_msg *msg, void *context)
{
    SID_PAL_LOG_INFO("Received message(type: %d, link_mode: %d, id: %u size %u)", (int)msg_desc->type,
                             (int)msg_desc->link_mode, msg_desc->id, msg->size);
    SID_PAL_HEXDUMP(SID_PAL_LOG_SEVERITY_INFO, msg->data, msg->size);
#if CFG_LED_SUPPORTED
    (void)led_indication_set(LED_INDICATE_RCV_OK);
#endif /* CFG_LED_SUPPORTED */
}

/*----------------------------------------------------------------------------*/

static void on_sidewalk_msg_sent(const struct sid_msg_desc *msg_desc, void *context)
{
    SID_PAL_LOG_INFO("Sent message(type: %d, id: %u)", (int)msg_desc->type, msg_desc->id);
#if CFG_LED_SUPPORTED
    (void)led_indication_set(LED_INDICATE_SENT_OK);
#endif /* CFG_LED_SUPPORTED */
}

/*----------------------------------------------------------------------------*/

static void on_sidewalk_send_error(sid_error_t error, const struct sid_msg_desc *msg_desc, void *context)
{
    SID_PAL_LOG_ERROR("Failed to send message(type: %d, id: %u), err:%d",
                  (int)msg_desc->type, msg_desc->id, (int)error);
#if CFG_LED_SUPPORTED
    (void)led_indication_set(LED_INDICATE_SEND_ERROR);
#endif /* CFG_LED_SUPPORTED */
}

/*----------------------------------------------------------------------------*/

static void on_sidewalk_status_changed(const struct sid_status *status, void *context)
{
    app_context_t *app_context = (app_context_t *)context;
    SID_PAL_LOG_INFO("Sidewalk status changed: %d", (int)status->state);
    switch (status->state)
    {
        case SID_STATE_READY:
#if CFG_LED_SUPPORTED
            (void)led_indication_set(LED_INDICATE_CONNECTED);
#endif /* CFG_LED_SUPPORTED */
            if (false == registration_pending)
            {
                /* Notify the user app that Sidewalk link can now be used */
                app_context->state = STATE_SIDEWALK_READY;
                osSemaphoreRelease(connection_ready_semaphore);
            }
            break;

        case SID_STATE_NOT_READY:
#if CFG_LED_SUPPORTED
            (void)led_indication_set(LED_INDICATE_BONDING);
#endif /* CFG_LED_SUPPORTED */
            app_context->state = STATE_SIDEWALK_NOT_READY;
            break;

        case SID_STATE_ERROR:
#if CFG_LED_SUPPORTED
            (void)led_indication_set(LED_INDICATE_ERROR);
#endif /* CFG_LED_SUPPORTED */
            SID_PAL_LOG_ERROR("Sidewalk error: %d", (int)sid_get_error(app_context->sidewalk_handle));
            SID_PAL_ASSERT(0);
            break;

        case SID_STATE_SECURE_CHANNEL_READY:
            app_context->state = STATE_SIDEWALK_SECURE_CONNECTION;
            break;

        default:
#if CFG_LED_SUPPORTED
            (void)led_indication_set(LED_INDICATE_ERROR);
#endif /* CFG_LED_SUPPORTED */
            SID_PAL_LOG_ERROR("Unknown Sidewalk state received: %d", (int)status->state);
            SID_PAL_ASSERT(0);
            break;
    }

    SID_PAL_LOG_INFO("Registration Status = %d, Time Sync Status = %d and Link Status Mask = %x",
                 status->detail.registration_status, status->detail.time_sync_status,
                 status->detail.link_status_mask);

    if ((registration_pending != false) && (SID_STATUS_REGISTERED == status->detail.registration_status))
    {
        /* Device registration completed, restart Sidewalk link to switch to 900MHz radio */
        SID_PAL_LOG_INFO("Device registration done, restarting Sidewalk link");
        registration_pending = false;
        queue_event(g_event_queue, EVENT_TYPE_REGISTRATION_COMPLETED);
    }

    app_context->link_status.link_mask = status->detail.link_status_mask;
    for (uint32_t i = 0u; i < SID_LINK_TYPE_MAX_IDX; i++)
    {
        app_context->link_status.supported_link_mode[i] = status->detail.supported_link_modes[i];
        SID_PAL_LOG_INFO("Link %d Mode %x", i, status->detail.supported_link_modes[i]);
    }
    if ((status->detail.link_status_mask & (SID_LINK_TYPE_2 | SID_LINK_TYPE_3)) != 0u)
    {
        print_subghz_link_profile(context);
    }
}

