TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/stm32wba/sid_900/STM32_WPAN/App/app_sidewalk.c
/*----------------------------------------------------------------------------*/

static void on_sidewalk_factory_reset(void *context)
{
    (void)context;

    SID_PAL_LOG_INFO("Factory reset notification received from sid api");
    (void)sid_hal_reset(SID_HAL_RESET_NORMAL);
}

/*----------------------------------------------------------------------------*/

static void send_ping(app_context_t *app_context)
{
    SID_PAL_LOG_INFO("Sending ping...");
    if (app_context->state == STATE_SIDEWALK_READY ||
        app_context->state == STATE_SIDEWALK_SECURE_CONNECTION)
    {
        SID_PAL_LOG_INFO("Sending counter update: %d", app_context->counter);
        struct sid_msg msg = {.data = (uint8_t*)&app_context->counter, .size = sizeof(uint8_t)};
        struct sid_msg_desc desc = {
            .type = SID_MSG_TYPE_NOTIFY,
            .link_type = SID_LINK_TYPE_ANY,
            .link_mode = SID_LINK_MODE_CLOUD,
        };

        if ((app_context->link_status.link_mask & SID_LINK_TYPE_1) &&
            (app_context->link_status.supported_link_mode[SID_LINK_TYPE_1_IDX] & SID_LINK_MODE_MOBILE))
        {
            desc.link_mode = SID_LINK_MODE_MOBILE;
        }

        sid_error_t ret = sid_put_msg(app_context->sidewalk_handle, &msg, &desc);
        if (ret != SID_ERROR_NONE)
        {
            SID_PAL_LOG_ERROR("Failed queueing data, err:%d", (int) ret);
#if CFG_LED_SUPPORTED
            (void)led_indication_set(LED_INDICATE_SEND_ERROR);
#endif /* CFG_LED_SUPPORTED */
        }
        else
        {
            SID_PAL_LOG_DEBUG("Queued data message id:%u", desc.id);
#if CFG_LED_SUPPORTED
            (void)led_indication_set(LED_INDICATE_SEND_ENQUEUED);
#endif /* CFG_LED_SUPPORTED */
        }
        app_context->counter++;
    }
    else
    {
        SID_PAL_LOG_WARNING("Send_ping: Sidewalk is not ready yet!");
#if CFG_LED_SUPPORTED
        (void)led_indication_set(LED_INDICATE_SEND_ERROR);
#endif /* CFG_LED_SUPPORTED */
    }
}

/*----------------------------------------------------------------------------*/

static void factory_reset(app_context_t * const context)
{
    /* Validate inputs */
    if (NULL == context)
    {
        SID_PAL_LOG_ERROR("Factory reset request failed - context cannot be null");
        return;
    }

    sid_error_t ret = sid_set_factory_reset(context->sidewalk_handle);
    if (ret != SID_ERROR_NONE)
    {
        SID_PAL_LOG_ERROR("Factory reset request failed: %d", (int32_t)ret);
    }
    else
    {
        SID_PAL_LOG_DEBUG("Factory reset initiated");
    }
}

/*----------------------------------------------------------------------------*/

static void print_subghz_link_profile(const app_context_t * const context)
{
    sid_error_t ret;
    struct sid_device_profile dev_cfg;

    do
    {
#if SID_SDK_CONFIG_ENABLE_LINK_TYPE_3
        dev_cfg.unicast_params.device_profile_id = SID_LINK3_PROFILE_A;
#elif SID_SDK_CONFIG_ENABLE_LINK_TYPE_2
        dev_cfg.unicast_params.device_profile_id = SID_LINK2_PROFILE_2;
#else
        ret = SID_ERROR_NOSUPPORT;
        break;
#endif /* SID_SDK_CONFIG_ENABLE_LINK_TYPE_3 */

        ret = sid_option(context->sidewalk_handle, SID_OPTION_900MHZ_GET_DEVICE_PROFILE, &dev_cfg, sizeof(dev_cfg));
        if (ret != SID_ERROR_NONE)
        {
            break;
        }

        SID_PAL_LOG_INFO("Current Sidewalk SubGHz mode: %s, rx_wndw_cnt: %u, wkup_type: %s, rx_interv: %ums",
                         sid_subghz_profile_code_to_str(dev_cfg.unicast_params.device_profile_id),
                         (uint32_t)dev_cfg.unicast_params.rx_window_count,
                         dev_cfg.unicast_params.wakeup_type < SID_STM32_UTIL_ARRAY_SIZE(sid_subghz_wakeup_type_strings) ? sid_subghz_wakeup_type_strings[dev_cfg.unicast_params.wakeup_type] : "Unknown",
#if SID_SDK_CONFIG_ENABLE_LINK_TYPE_3
                         (uint32_t)dev_cfg.unicast_params.unicast_window_interval.async_rx_interval_ms
#else
                         (uint32_t)dev_cfg.unicast_params.unicast_window_interval.sync_rx_interval_ms
#endif /* SID_SDK_CONFIG_ENABLE_LINK_TYPE_3 */
        );

        ret = SID_ERROR_NONE;
    } while (0);

    if (ret != SID_ERROR_NONE)
    {
        SID_PAL_LOG_ERROR("Failed to get Sidewalk SubGHz link profile info. Error %d", (int32_t)ret);
    }
}

/*----------------------------------------------------------------------------*/

#if SID_SDK_CONFIG_ENABLE_LINK_TYPE_2
static void adjust_sidewalk_link_log_level(const uint32_t link_mask)
{
    if (SID_PAL_LOG_LEVEL > SID_PAL_LOG_SEVERITY_INFO)
    {
        struct sid_log_control_severity sid_log_settings;
        sid_log_control_get_severity(&sid_log_settings);
        if ((link_mask & SID_LINK_TYPE_2) != 0u)
        {
            sid_log_settings.level = SID_PAL_LOG_SEVERITY_INFO;
        }
        else
        {
            sid_log_settings.level = SID_PAL_LOG_LEVEL;
        }
        sid_log_control_set_severity(&sid_log_settings);
    }
}
#endif /* SID_SDK_CONFIG_ENABLE_LINK_TYPE_2 */

/*----------------------------------------------------------------------------*/

static sid_error_t init_and_start_link(app_context_t * const context, struct sid_config * const config, const bool cold_start)
{
    sid_error_t ret = SID_ERROR_GENERIC;
    struct sid_handle *sid_handle = NULL;
    struct sid_status status;

    /* Validate inputs */
    if (NULL == context)
    {
        SID_PAL_LOG_ERROR("Sidewalk context cannot be null");
        ret = SID_ERROR_NULL_POINTER;
        goto error;
    }

    if (NULL == config)
    {
        SID_PAL_LOG_ERROR("Sidewalk config cannot be null");
        ret = SID_ERROR_NULL_POINTER;
        goto error;
    }

    /* Make sure Sidewalk is not initialized already */
    if (context->sidewalk_handle != NULL)
    {
        SID_PAL_LOG_ERROR("Sidewalk is initialized already");
        ret = SID_ERROR_ALREADY_INITIALIZED;
        goto error;
    }

    /* Initialize state indication to the user app */
    context->state = STATE_SIDEWALK_NOT_READY;

    if (cold_start != false)
    {
#if SID_FSK_ONLY_LINK
        /* For FSK-only mode start with FSK mode and handle the device registration over the FSK link */
        config->link_mask = SID_COMM_LINK_TYPE;
#else
        /* Initialize Sidewalk in BLE or FSK mode to check device registration status */
        /* WARNING: starting in LoRa-only mode is not allowed if the device is not registered. Calling sid_init() will always return an error */
        config->link_mask = SID_REGISTRATION_LINK_TYPE;
#endif /* SID_FSK_ONLY_LINK */
        ret = sid_init(config, &sid_handle);
        if (ret != SID_ERROR_NONE)
        {
            SID_PAL_LOG_ERROR("Failed to initialize Sidewalk stack, link_mask:%x, err:%d", (int)config->link_mask, (int)ret);
            goto error;
        }

        /* Register sidewalk handle to the application context */
        context->sidewalk_handle = sid_handle;

