TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/stm32wba/sid_900/STM32_WPAN/App/app_sidewalk.c
        ret = sid_get_status(sid_handle, &status);
        if (ret != SID_ERROR_NONE)
        {
            SID_PAL_LOG_ERROR("Failed to get Sidewalk stack status, err:%d", (int)ret);
            goto error;
        }

        SID_PAL_LOG_INFO("Sidewalk registration status: %s", status.detail.registration_status == SID_STATUS_REGISTERED ? "Registered" : "Not registered");

        if (SID_STATUS_REGISTERED == status.detail.registration_status)
        {
            /* Indicate to the app that Sidewalk device registration is completed */
            queue_event(g_event_queue, EVENT_TYPE_REGISTRATION_COMPLETED);
#if SID_FSK_ONLY_LINK
            /* Proceed with starting FSK link as stack re-initialization is not required */
#else
            /* Terminate from here, Sidewalk stack should be re-initialzed to switch from registration mode link to normal mode link */
            return SID_ERROR_NONE;
#endif /* SID_FSK_ONLY_LINK */
        }
        else
        {
            /* Indicate registration process is pending */
            registration_pending = true;
        }
    }
    else
    {
        /* This is a re-initialization attempt, we assume that registration is completed at this point */
        config->link_mask = SID_COMM_LINK_TYPE;
        ret = sid_init(config, &sid_handle);
        if (ret != SID_ERROR_NONE)
        {
            SID_PAL_LOG_ERROR("Failed to initialize Sidewalk link_mask:%x, err:%d", (int)config->link_mask, (int)ret);
            goto error;
        }

        /* Register new Sidewalk handle to the application context */
        context->sidewalk_handle = sid_handle;
    }

#if (SID_SDK_CONFIG_ENABLE_LINK_TYPE_2)
    /* Reduce log level for FSK connection since it produces excessive logs that affect communication timings */
    adjust_sidewalk_link_log_level(config->link_mask);
#endif /* SID_SDK_CONFIG_ENABLE_LINK_TYPE_2 */

    /* Start the Sidewalk stack with the selected link type */
    ret = sid_start(sid_handle, config->link_mask);
    if (ret != SID_ERROR_NONE)
    {
        SID_PAL_LOG_ERROR("Failed to start Sidewalk stack, link_mask:%x, err:%d", (int)config->link_mask, (int)ret);
        goto error;
    }

    return ret;

error:
    context->sidewalk_handle = NULL;
    config->link_mask = 0;
    return ret;
}

/*----------------------------------------------------------------------------*/

static sid_error_t set_device_profile(app_context_t * const context, struct sid_device_profile * const set_dp_cfg)
{
    sid_error_t ret;
    struct sid_device_profile dev_cfg;

    do
    {
#if SID_SDK_CONFIG_ENABLE_LINK_TYPE_3
        dev_cfg.unicast_params.device_profile_id = SID_LINK3_PROFILE_A;
#elif SID_SDK_CONFIG_ENABLE_LINK_TYPE_2
        dev_cfg.unicast_params.device_profile_id = SID_LINK2_PROFILE_2;
#else
        ret = SID_ERROR_NOSUPPORT;
        break;
#endif /* SID_SDK_CONFIG_ENABLE_LINK_TYPE_3 */

        ret = sid_option(context->sidewalk_handle, SID_OPTION_900MHZ_GET_DEVICE_PROFILE, &dev_cfg, sizeof(dev_cfg));
        if (ret != SID_ERROR_NONE)
        {
            break;
        }

        if ((set_dp_cfg->unicast_params.device_profile_id != dev_cfg.unicast_params.device_profile_id)
#if SID_SDK_CONFIG_ENABLE_LINK_TYPE_3
         || (set_dp_cfg->unicast_params.unicast_window_interval.async_rx_interval_ms != dev_cfg.unicast_params.unicast_window_interval.async_rx_interval_ms)
#else
         || (set_dp_cfg->unicast_params.unicast_window_interval.sync_rx_interval_ms != dev_cfg.unicast_params.unicast_window_interval.sync_rx_interval_ms)
#endif /* SID_SDK_CONFIG_ENABLE_LINK_TYPE_3 */
         || (set_dp_cfg->unicast_params.rx_window_count   != dev_cfg.unicast_params.rx_window_count))
        {
            ret = sid_option(context->sidewalk_handle, SID_OPTION_900MHZ_SET_DEVICE_PROFILE, set_dp_cfg, sizeof(dev_cfg));
        }
        else
        {
            ret = SID_ERROR_NONE;
            SID_PAL_LOG_INFO("Sidewalk SubGHz mode is already set to the desired configuration");
        }
    } while (0);

    return ret;
}

/*----------------------------------------------------------------------------*/

static sid_error_t destroy_link(app_context_t *app_context, struct sid_config *const config)
{
    sid_error_t ret;
    do
    {
        if (NULL == app_context)
        {
            ret = SID_ERROR_UNINITIALIZED;
            break;
        }

        if ((NULL == app_context->sidewalk_handle) || (NULL == config))
        {
            ret = SID_ERROR_INVALID_ARGS;
            break;
        }

        ret = sid_stop(app_context->sidewalk_handle, config->link_mask);
        if(ret != SID_ERROR_NONE)
        {
            break;
        }
        ret = sid_deinit(app_context->sidewalk_handle);
        if(ret != SID_ERROR_NONE)
        {
            break;
        }
        app_context->sidewalk_handle = NULL;
#if CFG_LED_SUPPORTED
        (void)led_indication_set(LED_INDICATE_IDLE);
#endif /* CFG_LED_SUPPORTED */
    } while (0);

    return ret;
}

/*----------------------------------------------------------------------------*/

#if (CFG_BUTTON_SUPPORTED == 1)
#  if (defined(STM32WBA6x) && !defined(SID_RADIO_PLATFORM_LR11XX) && !defined(SID_RADIO_PLATFORM_SX126X)) || !defined(STM32WBA6x) /* Semtech shields share the same EXTI line for BUSY signal */
static void button1_irq_handler(uint32_t pin, void * callback_arg)
{
    static uint32_t uStart = BUTTON_TIMESTAMP_INVALID_VAL;
    static uint32_t uEnd   = BUTTON_TIMESTAMP_INVALID_VAL;
    uint8_t pinState;
    sid_error_t ret;

    (void)callback_arg;

    ret = sid_pal_gpio_read(pin, &pinState);
    if (SID_ERROR_NONE == ret)
    {
        if (GPIO_PIN_RESET == pinState)
        {
            uStart = osKernelGetTickCount();
        }
        else if (uStart != BUTTON_TIMESTAMP_INVALID_VAL)
        {
            uEnd = osKernelGetTickCount();

            if((uEnd - uStart) < OS_MS_TO_TICKS(BUTTON_LONG_PRESS_MS))
            {
                /* Short-press event */
                queue_event(g_event_queue, EVENT_TYPE_TOGGLE_LINK);
            }
            else
            {
                /* Long-press event */
                queue_event(g_event_queue, EVENT_FACTORY_RESET);
            }

            /* Reset start timestamp */
            uStart = BUTTON_TIMESTAMP_INVALID_VAL;
        }
        else
        {
            /**
             * Invalid state - rising edge detected but preceding falling edge was not.
             * This may happen due to GPIO transitions when leaving Standby LPM. The options are
             * either to ignore such events (like it is done here) or enable GPIO pin retention
             * for the respective GPIO pin before entering Standby LPM, but this will result in
             * higher quiescent current.
             */
        }
    }
    else
    {
        SID_PAL_LOG_ERROR("Failed to read B1 state. Error %d", (int32_t)ret);
    }
}
#  endif /* (STM32WBA6x && !SID_RADIO_PLATFORM_LR11XX && !SID_RADIO_PLATFORM_SX126X) || !STM32WBA6x */

