TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/stm32wba/sid_900/STM32_WPAN/App/app_sidewalk.c
/*----------------------------------------------------------------------------*/

#  if (defined(STM32WBA5x) && !defined(SID_RADIO_PLATFORM_LR11XX) && !defined(SID_RADIO_PLATFORM_SX126X)) || !defined(STM32WBA5x) /* Semtech shields use the same GPIO pin for BUSY signal */
static void button2_irq_handler(uint32_t pin, void * callback_arg)
{
    (void)pin;
    (void)callback_arg;

    static uint32_t uStart = BUTTON_TIMESTAMP_INVALID_VAL;
    static uint32_t uEnd   = BUTTON_TIMESTAMP_INVALID_VAL;
    uint8_t pinState;
    sid_error_t ret;

     ret = sid_pal_gpio_read(pin, &pinState);
    if (SID_ERROR_NONE == ret)
    {
        if (GPIO_PIN_RESET == pinState)
        {
            uStart = osKernelGetTickCount();
        }
        else if (uStart != BUTTON_TIMESTAMP_INVALID_VAL)
        {
            uEnd = osKernelGetTickCount();

            if((uEnd - uStart) >= (4u * OS_MS_TO_TICKS(BUTTON_LONG_PRESS_MS)))
            {
                /* Extra-long-press event */
#    if (CFG_LPM_STDBY_SUPPORTED != 0)
                /* Enter Standby LPM without retention */
                queue_event(g_event_queue, EVENT_TYPE_FULL_STANDBY);
#    endif /* CFG_LPM_STDBY_SUPPORTED */
            }
            else if((uEnd - uStart) < OS_MS_TO_TICKS(BUTTON_LONG_PRESS_MS))
            {
                /* Short-press event */
                queue_event(g_event_queue, EVENT_TYPE_SET_DEVICE_PROFILE);
            }
            else
            {
                /* Long-press event */
#    if  defined(STM32WBA6x) && (defined(SID_RADIO_PLATFORM_LR11XX) || defined(SID_RADIO_PLATFORM_SX126X)) /* Semtech shields occupy B1 EXTI line for BUSY signal, use long B2 press instead */
                queue_event(g_event_queue, EVENT_TYPE_TOGGLE_LINK);
#    endif  /* STM32WBA6x && (SID_RADIO_PLATFORM_LR11XX || SID_RADIO_PLATFORM_SX126X) */
            }

            /* Reset start timestamp */
            uStart = BUTTON_TIMESTAMP_INVALID_VAL;
        }
        else
        {
            /**
             * Invalid state - rising edge detected but preceding falling edge was not.
             * This may happen due to GPIO transitions when leaving Standby LPM. The options are
             * either to ignore such events (like it is done here) or enable GPIO pin retention
             * for the respective GPIO pin before entering Standby LPM, but this will result in
             * higher quiescent current.
             */
        }
    }
    else
    {
        SID_PAL_LOG_ERROR("Failed to read B2 state. Error %d", (int32_t)ret);
    }
}
#  endif /* (STM32WBA5x && !SID_RADIO_PLATFORM_LR11XX && !SID_RADIO_PLATFORM_SX126X) || !STM32WBA5x */

/*----------------------------------------------------------------------------*/

static void button3_irq_handler(uint32_t pin, void * callback_arg)
{
    static uint32_t uStart = BUTTON_TIMESTAMP_INVALID_VAL;
    static uint32_t uEnd   = BUTTON_TIMESTAMP_INVALID_VAL;
    uint8_t pinState;
    sid_error_t ret;

    (void)callback_arg;

    ret = sid_pal_gpio_read(pin, &pinState);
    if (SID_ERROR_NONE == ret)
    {
        if (GPIO_PIN_RESET == pinState)
        {
            uStart = osKernelGetTickCount();
        }
        else if (uStart != BUTTON_TIMESTAMP_INVALID_VAL)
        {
            uEnd = osKernelGetTickCount();

#  if defined(SID_RADIO_PLATFORM_LR11XX) || defined(SID_RADIO_PLATFORM_SX126X) /* Semtech shields occupy B2 GPIO pin for BUSY signal, use extra-long B3 press instead */
            if((uEnd - uStart) >= (4u * OS_MS_TO_TICKS(BUTTON_LONG_PRESS_MS)))
            {
                /* Extra-long-press event */
#    if defined(STM32WBA6x)
                queue_event(g_event_queue, EVENT_FACTORY_RESET);
#    elif defined(STM32WBA5x)
                queue_event(g_event_queue, EVENT_TYPE_SET_DEVICE_PROFILE);
#    endif /* STM32WBA6x || STM32WBA5x */
            }
            else
#  endif /* SID_RADIO_PLATFORM_LR11XX || SID_RADIO_PLATFORM_SX126X */
            if((uEnd - uStart) < OS_MS_TO_TICKS(BUTTON_LONG_PRESS_MS))
            {
                /* Short-press event */
                queue_event(g_event_queue, EVENT_TYPE_SEND_HELLO);
            }
            else
            {
                /* Long-press event */
#  if (CFG_LPM_STDBY_SUPPORTED != 0)
                /* Enter Standby LPM with retention and keep Sidewalk running */
                queue_event(g_event_queue, EVENT_TYPE_ACTIVE_STANDBY);
#  endif /* CFG_LPM_STDBY_SUPPORTED */
            }

            /* Reset start timestamp */
            uStart = BUTTON_TIMESTAMP_INVALID_VAL;
        }
        else
        {
            /**
             * Invalid state - rising edge detected but preceding falling edge was not.
             * This may happen due to GPIO transitions when leaving Standby LPM. The options are
             * either to ignore such events (like it is done here) or enable GPIO pin retention
             * for the respective GPIO pin before entering Standby LPM, but this will result in
             * higher quiescent current.
             */
        }
    }
    else
    {
        SID_PAL_LOG_ERROR("Failed to read B3 state. Error %d", (int32_t)ret);
    }
}

/*----------------------------------------------------------------------------*/

#  if (CFG_LPM_STDBY_SUPPORTED != 0)
static void button3_wakeup_handler(uint32_t pin, void * callback_arg)
{
    (void)pin;
    (void)callback_arg;

    /* Disable Standby LPM */
    UTIL_LPM_SetOffMode(1U << CFG_LPM_APP, UTIL_LPM_DISABLE);

    /* Prevent B3 from triggering WKUP IRQ on pressing till the next entry to Standby mode */
    (void)sid_pal_gpio_ext_ifc_wakeup_disable(GPIO_PORT_PIN_TO_NUM(B3_GPIO_PORT, B3_PIN));

    SID_PAL_LOG_INFO("Standby mode deactivated");
}
#  endif /* (CFG_LPM_STDBY_SUPPORTED != 0) */

/*----------------------------------------------------------------------------*/

static void buttons_init(void)
{
    sid_error_t ret_code;

#  if (defined(STM32WBA6x) && !defined(SID_RADIO_PLATFORM_LR11XX) && !defined(SID_RADIO_PLATFORM_SX126X)) || !defined(STM32WBA6x) /* Semtech shields share the same EXTI line for BUSY signal */
    ret_code = sid_pal_gpio_pull_mode(GPIO_PORT_PIN_TO_NUM(B1_GPIO_PORT, B1_PIN), SID_PAL_GPIO_PULL_UP);
    SID_PAL_ASSERT(ret_code == SID_ERROR_NONE);
    ret_code = sid_pal_gpio_set_direction(GPIO_PORT_PIN_TO_NUM(B1_GPIO_PORT, B1_PIN), SID_PAL_GPIO_DIRECTION_INPUT);
    SID_PAL_ASSERT(ret_code == SID_ERROR_NONE);
#  endif /* (STM32WBA6x && !SID_RADIO_PLATFORM_LR11XX && !SID_RADIO_PLATFORM_SX126X) || !STM32WBA6x */

