TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/stm32wba/sid_900/STM32_WPAN/App/app_sidewalk.c
                case EVENT_FACTORY_RESET:
                    factory_reset(app_context);
                    break;

#if (CFG_BUTTON_SUPPORTED != 0) && (CFG_LPM_STDBY_SUPPORTED != 0)
                case EVENT_TYPE_ACTIVE_STANDBY:
                    /**
                     * Note: Sidewalk keeps running in this mode. However, LEDs and buttons will be inactive (except the wakeup source)
                     * due to GPIO being powered down. Periodic wakeups to handle Sidewalk events are indicated by LEDs activation while
                     * the MCU is in Run mode. As soon as Sidewalk radio event is processed, the LEDs are turned off and the system goes
                     * back into Standby LPM.
                     */

                    /* Use B3 button release as a wakeup trigger */
                    ret = sid_pal_gpio_ext_ifc_wakeup_enable(GPIO_PORT_PIN_TO_NUM(B3_GPIO_PORT, B3_PIN), SID_PAL_GPIO_IRQ_TRIGGER_RISING, button3_wakeup_handler, NULL);
                    if (ret != SID_ERROR_NONE)
                    {
                        SID_PAL_LOG_ERROR("Error entering in standby mode: unable to configure wakeup pin, err:%d", (int)ret);
                        goto error;
                    }

                    /* Enable Standby LPM */
                    UTIL_LPM_SetOffMode(1U << CFG_LPM_APP, UTIL_LPM_ENABLE);
                    SID_PAL_LOG_INFO("Standby with retention mode enabled");
                    break;

                case EVENT_TYPE_FULL_STANDBY:
                    /**
                     * Note: Sidewalk connectivity is not available in this mode since neither RAM nor peripheral states are retained.
                     * This mode allows to achieve the lowest power consumption since the only running unit is RTC. System can be woken
                     * up by pressing B3 or scheduling an RTC event. Wakeup startup process is identical to MCU reset flow since all
                     * units have to be initialized from scratch (except RTC).
                     */
                    if ((app_context != NULL) && (app_context->sidewalk_handle != NULL))
                    {
                        ret = destroy_link(app_context, &config);
                        if (ret != SID_ERROR_NONE)
                        {
                            SID_PAL_LOG_ERROR("Error entering in standby mode: unable to terminate Sidewalk link. Error code: %d", (int)ret);
                            goto error;
                        }
                    }

                    /* Use B3 button release as a wakeup trigger */
                    ret = sid_pal_gpio_ext_ifc_wakeup_enable(GPIO_PORT_PIN_TO_NUM(B3_GPIO_PORT, B3_PIN), SID_PAL_GPIO_IRQ_TRIGGER_RISING, button3_wakeup_handler, NULL);
                    if (ret != SID_ERROR_NONE)
                    {
                        SID_PAL_LOG_ERROR("Error entering in standby mode: unable to configure wakeup pin, err:%d", (int)ret);
                        goto error;
                    }

                    /* Suspend demo task to avoid periodic wakeups from Standby mode */
                    if (demo_counter_task != NULL)
                    {
                        (void)osThreadSuspend(demo_counter_task);
                    }

#  if CFG_LED_SUPPORTED
                    /* Turn off LEDs */
                    led_indication_set(LED_INDICATE_OFF);
#  endif /* CFG_LED_SUPPORTED */

                    /* Disable RAM retention to achieve lowest possible power consumption */
                    HAL_PWREx_DisableSRAM1ContentStandbyRetention();
                    HAL_PWREx_DisableSRAM2ContentStandbyRetention();

                    /* Enable Standby LPM */
                    UTIL_LPM_SetOffMode(1U << CFG_LPM_APP, UTIL_LPM_ENABLE);
                    SID_PAL_LOG_INFO("Entering Standby w/o retention mode...");
                    break;
#endif /* CFG_BUTTON_SUPPORTED && CFG_LPM_STDBY_SUPPORTED */

                default:
                    /* Ignore unknown events */
                    break;
            }
        }
    }

error:
    if (demo_counter_task != NULL)
    {
        (void)osThreadTerminate(demo_counter_task);
        demo_counter_task = NULL;
    }

    if (app_context->sidewalk_handle != NULL)
    {
        sid_stop(app_context->sidewalk_handle, config.link_mask);
        sid_deinit(app_context->sidewalk_handle);
        app_context->sidewalk_handle = NULL;
    }

#if CFG_LED_SUPPORTED
    (void)led_indication_set(LED_INDICATE_OFF);
#endif /* CFG_LED_SUPPORTED */

    SID_PAL_LOG_INFO("Sidewalk demo terminated due to error");
    Error_Handler();

    osThreadExit(); /* Normally this line is not reachable, but keep it if Error_Handler somehow returns */
}

/*----------------------------------------------------------------------------*/

static void demo_counter_task_entry(void *context)
{
    app_context_t *app_context = (app_context_t *)context;
    osStatus_t status;

    SID_PAL_LOG_INFO("Demo Counter Thread: waiting for the Sidewalk registration to be completed...");
    status = osSemaphoreAcquire(registration_ready_semaphore, osWaitForever);
    if (status != osOK)
    {
        SID_PAL_LOG_ERROR("Demo Counter Thread - failed to wait for Sidewalk device registration to be completed");
        goto error;
    }
    SID_PAL_LOG_INFO("Demo Counter Thread: Sidewalk device is registered, proceeding with the demo...");

    while (1)
    {
        if ((app_context->state != STATE_SIDEWALK_READY) && (app_context->state != STATE_SIDEWALK_SECURE_CONNECTION))
        {
            SID_PAL_LOG_DEBUG("Demo Counter Thread: waiting for the Sidewalk connection");
        }

        osStatus_t status = osSemaphoreAcquire(connection_ready_semaphore, 15000u);
        if (status != osOK)
        {
            if (osErrorTimeout == status)
            {
                SID_PAL_LOG_WARNING("Demo Counter Thread: Sidewalk connection is not available");
            }
            else
            {
                SID_PAL_LOG_ERROR("Demo Counter Thread: unable to establish Sidewalk connection. Error code: %d", status);
            }
            continue;
        }

